tutorials/Irregular_wave_3D_DeformationMesh/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
	poroussixDoFMooring
	poroussixDoFRigidBodyMotion
);

application     porousolaFlow;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         20;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   0.1;

timeSchedule
(
    (0 1 20)    // 从0到20秒，间隔1秒
    (20 0.1 30) // 从20到30秒，间隔0.1秒
);

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

compression     off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.2;
maxAlphaCo      0.2;
maxDeltaT       0.05;

functions
{  
       //#include "forceCoeffs" 
       #includeFunc  sampleDict

}


// ************************************************************************* //
