tutorials/Irregular_wave_3D_DeformationMesh/constant/waveDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

waveType        regular;

waveTheory      StokesIII;

genAbs          1;

absDir          0.0;

nPaddles        25;

wavePeriod      1.2;

waveHeight      0.08;

waveDir         30.0;

wavePhase       1.57079633;

tSmooth         0.0;


// ************************************************************************* //
